
// Задача 2: Задайте массив на 10 целых чисел.
// Напишите программу, которая определяет
// количество чётных чисел в массиве.

class Program
{
    static void Main()
    {
        // Задаем массив из 10 целых чисел
        int[] array = { 5, 12, 7, 14, 23, 30, 18, 42, 56, 91 };

        // Находим количество четных чисел в массиве
        int count = 0;

        foreach (int number in array)
        {
            if (number % 2 == 0)
            {
                count++;
            }
        }

        Console.WriteLine($"Количество четных чисел в массиве: {count}");
    }
}